{
    "experiences": [
        {
            "id": 1,
            "role": "Software Engineer",
            "company": "Booz Allen Hamilton",
            "period": "2022 - Present",
            "logo": "../../../public/bz.png",
            "details": [
                "Supporting GSA on an active federal contracts.",
                "IRA-IRS, Event Driven Architectures, Developed the front end using React and Apollo Client. Contributed to the UI/UX design of the Event Catalog platform.",
                "OLS-IRS, Created and updated React-based UI components for the IRS development team.",
                "TaskTracker, Collaborated with a team to build a comprehensive tool using React.js for tracking employee availability, project assignments, and contract progress across Booz Allen."
            ],
            "skills": ["React", "Jekyll", "Tailwind", "Docker", "JS/TS", "USWDS", "GraphQL"]
        },
        {
            "id": 2,
            "role": "UI & Front-End Developer",
            "company": "Pacific Western Bank",
            "period": "2021 - 2022",
            "logo": "../../../public/pacwest1.jpg",
            "details": [
                "Designed and built an internal CMS for business clients (including companies and corporations) using Next.js.",
                "Redesigned and enhanced UI features across multiple banking platforms to improve usability and visual consistency."
            ],
            "skills": ["React","Next", "Adove XD", "Tailwind", "RESTful-APIs", "JS/TS"]
        },
        {
            "id": 3,
            "role": "UI Developer",
            "company": "MirLogic Solutions Corp.",
            "period": "2019 - 2021",
            "logo": "../../../public/mir.jpeg",
            "details": [
                "Designed and created mock-ups for new features and public-facing pages for federal clients, including the CDC and U.S. Army.primarily using modern.",
                "Developed a new corporate website from the ground up to align with updated branding and accessibility standards.",
                "Built interactive data visualizations using D3.js for NCHS statistical reports.",
                "Maintained and updated national COVID-19 statistics on a daily and weekly basis for public dashboards."
            ],
            "skills": ["JS/TS", "UI/UX", "Adobe XD", "React", "Power BI", "wordpress", "D3.js"]
        },
        {
            "id": 4,
            "role": "Web Developer",
            "company": "Clearly Innovative Inc.",
            "period": "2018 - 2019",
            "logo": "../../../public/ci.png",
            "details": [
                "Built responsive and reactive web applications using Angular, Vue.js, and Ionic",
                "Collaborated with UX researchers to translate insights into polished multi-page web and mobile app designs.",
                "Collaborated with team members on project requirements and solutions",
                "Sub-contracted to Deloitte LLP, where I joined the design and development team of a customer appointment tracker using HTML5, CSS, JavaScript, and Node.js."
            ],
            "skills": ["JS/TS", "Ionic", "Vue", "Angular", "HTML", "Bootstrap"]
        }
    ]
}